ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g518x/COMP0_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="COMP0" HW_revision="1.0">
    <register id="COMP0_FSUB_0" width="32" offset="0x400" description="Subscriber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="COMP0_FSUB_1" width="32" offset="0x404" description="Subscriber Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="COMP0_FPUB_1" width="32" offset="0x444" description="Publisher port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="COMP0_GPRCM" name="COMP0_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="COMP0_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="COMP0_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="COMP0_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="Disable" value="0x0" description="disable COMP to request SYSOSC"/>
                <bitenum id="Enable" value="0x1" description="enable COMP to request SYSOSC"/>
            </bitfield>
        </register>
        <register id="COMP0_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <group id="COMP0_CPU_INT" name="COMP0_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="COMP0_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="1" end="0" width="2" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No pending interrupt"/>
                <bitenum id="COMPIFG" value="0x2" description="Comparator output interrupt"/>
                <bitenum id="COMPINVIFG" value="0x3" description="Comparator output inverted interrupt"/>
                <bitenum id="OUTRDYIFG" value="0x4" description="Comparator output ready interrupt"/>
            </bitfield>
        </register>
        <register id="COMP0_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="COMPIFG" description="Masks COMPIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Masks COMPINVIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Masks OUTRDYIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
        </register>
        <register id="COMP0_CPU_INT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="COMPIFG" description="Raw interrupt status for comparator output interrupt flag. The IES bit defines the transition of the comparator output setting this bit." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Raw interrupt status for comparator output inverted interrupt flag. The IES bit defines the transition of the comparator output setting this bit." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Raw interrupt status for comparator output ready interrupt flag. This bit is set when the comparator output is valid." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
        </register>
        <register id="COMP0_CPU_INT_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="COMPIFG" description="Masked interrupt status for COMPIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="COMPIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="COMPIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Masked interrupt status for COMPINVIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="COMPINVIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="COMPINVIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Masked interrupt status for OUTRDYIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="OUTRDYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="OUTRDYIFG requests an interrupt service routine"/>
            </bitfield>
        </register>
        <register id="COMP0_CPU_INT_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="COMPIFG" description="Sets COMPIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to COMPIFG is set"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Sets COMPINVIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to COMPINVIFG is set"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Sets OUTRDYIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to OUTRDYIFG is set"/>
            </bitfield>
        </register>
